<template>
  <div>
    <div class="navbar">
      <div class="left-btn">
        <i class="iconfont iconxiazai6" @click="returnRegister"></i>
      </div>
      <div class="item title">
        时间银行用户协议
      </div>
    </div>
    <div class="wapper">
      <div class="agreement">
        <p>时间银行是一个面向企业负责人提供管理咨询与精英型人才撮合交易服务的平台，隶属于青岛商帝国管理咨询有限公司（以下简称“商帝国”）。当企业遇到任何领域问题，都可以在这里找到各领域富有经验的讲师，交付一定费用，获得登门服务机会，由讲师为企业提供对口服务。</p>
        <p>时间银行由网站、移动客户端所构成。在时间银行，用户协议是用户与时间银行网站、移动客户端之间就相关事宜所订立的契约，包含用户（包括但不限于“企业”、“讲师”）和时间银行之间所有的条款和条件。</p>
        <p>商帝国严格遵循《互联网信息服务管理办法》、《互联网用户帐号名称管理规定》、《互联网新闻信息服务管理规定》等国家法律、法规的精神及内容制定该协议。作为平台用户，在注册时间银行网站、移动客户端前，必须事先认真阅读本用户协议，认可并同意本用户协议更新版的全部内容。特别是本协议中免除、减轻或者限制商帝国责任的全部协议内容以及含有限制用户权利内容的协议内容。希望各位用户能在严格遵守国家法律、法规及平台相关规章制度的前提下，使用时间银行。</p>
        <p>如果您同意本用户协议，或者您事实上存在使用行为，将被视为您完全接受本用户协议的全部内容及条款，包括接受时间银行对用户协议随时所做的任何修改及更新。同时也表示您同意时间银行所发布或随时更新的隐私声明，本协议即构成对双方均具有约束力的法律文件。如您不同意本用户协议，您应不得使用或主动取消时间银行所提供的服务。</p>
        <p>第一条 协议内容及生效</p>
        <p>1.1 本用户协议内容包括以下所有正文及时间银行网站、移动客户端平台已经发布或将来可能发布的各类规则、解释、声明、通告等。所有上述规则、解释、声明及通告等都被视为本用户协议的组成部分，具有同等的法律效力</p>
        <p>1.2 用户下载、注册、登录、使用及连接时间银行服务均被视为用户已完全了解、接受并同意遵守本用户协议的所有内容。时间银行有权在必要时单方修改用户协议，并通过网站和/或者客户端发布修改变更，不再另行单独通知。修改后的协议一经发布即代替旧版本协议，自动更新为用户与时间银行之间的适用协议。如在用户协议更新并生效后，用户继续使用时间银行服务，则视为您已完全了解、接受用户协议的更新并同意遵守更新后的用户协议。如用户不接受时间银行更新后的用户协议，请立即停止使用时间银行服务。</p>
        <p>1.3 时间银行网站、移动客户端所有服务的所有权、运作权和解释权均归商帝国所有。用户同意本用户协议内容并完成注册程序，即成为时间银行的正式用户，即被视为用户确认自己具有独立的行为能力，明确自己所享有的相应权利，能够独立承担法律责任。</p>
        <p>1.4 如果您未满18周岁，必须在父母或者监护人监护之下使用时间银行。</p>
        <p>1.5 用户特此声明，已经完全理解本用户协议所有内容，并不存在任何重大误解；同时，认可本用户协议并不存在显失公平的情形。</p>
        <p>第二条 用户信息</p>
        <p>2.1 用户个人信息。用户注册时间银行平台帐号，需按照“后台实名、前台自愿”的原则，先行通过真实身份信息认证。用户个人信息包括但不限于：用户真实姓名、证件号码、职业、职务、头像、手机电话、银行账号、第三方支付账号、电子邮件、教育经历、从业经历等。</p>
        <p>2.2 非用户个人信息。用户在时间银行网站及移动客户端服务器上，包括讲师话题、用户私聊、操作状态、使用记录、使用习惯等在内的全部记录信息。除本条第1款所列用户个人信息范围外的其他所有信息，均视为非用户个人信息。</p>
        <p>2.3 注册信息。用户向时间银行所提交的帐号名称、头像及简介等内容不得出现违法及不良信息。对含有此类违法及不良信息的帐号，商帝国有权不予注册。同时，为保护用户个人信息及公民隐私，时间银行将自觉接受社会监督，及时处理公众举报的帐号名称、头像、简介等注册信息中的违法和不良信息。</p>
        <p>2.4 第三方平台记录信息。用户通过腾讯微信等第三方平台账号注册、登陆、使用时间银行服务的，将被视为用户完全理解、同意并接受时间银行已包括但不限于收集、统计、分析等方式使用其在腾讯微信等第三方平台填写、登记、公布、记录的全部信息。用户一旦使用第三方平台账号注册、登陆、使用时间银行服务，时间银行对该第三方记录信息的任何使用，均被视为已经获得了用户本人的完全同意并接受。</p>
        <p>2.5 用户在时间银行网站、移动客户端所涉及的包括个人真实姓名、手机电话、电子邮件、通信地址等在内的用户个人信息、注册信息、第三方平台账号信息以及非用户个人信息，时间银行在此承诺，均予以严格保密，除非经用户明确授权或者法律另有规定之外，时间银行不会向任何第三方 / 第三人披露上述用户隐私信息。时间银行尊重用户的合法权利，不会以违反法律、行政法规以及本协议约定的方式收集、保存、使用用户信息。</p>
        <p>2.6 用户应本着诚实守信的原则，自行向时间银行提供个人信息、注册信息、教育经历、工作经历、交谈话题以及相关的其他必要信息，所提供的信息必须在合法基础上保证真实、准确、完整，并保证及时更新以上信息。如因用户自行提供的信息存在非法、抄袭、错误等问题，用户需承担因此引发的相应的法律责任及后果，且时间银行保留终止用户使用时间银行各项服务的权利，且时间银行可以保留向被侵权的第三方披露此类用户的个人信息之相关权利。用户以虚假信息骗取账户名称注册，或其帐号头像、简介等注册内容存在违法和不良信息的，时间银行有权采取通知限期改正、暂停使用、注销登记等处理措施。</p>
        <p>2.7 用户应自行维护个人的时间银行平台之上的帐户和密码安全，并对此帐户在时间银行各个网站、移动客户端上的所有行为负完全责任。用户不得将帐户转借给他人使用，否则应承担由此可能产生的全部责任，并与实际使用人承担连带责任。用户应对任何人利用您的帐户和密码所进行的活动负完全责任，时间银行无法对非法或未经您授权使用您的帐户及密码的行为做出甄别，因此时间银行不承担任何责任。当密码或者帐户遭到未获授权使用，或者发生任何安全问题时，用户有责任及时有效地通知时间银行并向当地公安机关报案。时间银行帐号的所有权隶属于商帝国所有，用户完成开通授权手续后，仅获得时间银行帐号的使用权，且该使用权仅属于初始申请注册人。同时，初始申请注册人不得赠与、借用、租用、转让或售卖时间银行帐号或者以其他方式许可非初始申请注册人使用时间银行帐号。非初始申请注册人不得通过受赠、继承、承租、受让或者其他任何方式使用时间银行帐号。</p>
        <p>2.8 用户信息使用。用户在使用过程中发现任何不妥或者不满意之处，有权向时间银行后台服务团队以邮件或者电话方式提出申请，进行相关信息删除等处理：时间银行不承担主动删除、销毁用户信息的责任。</p>
        <p>2.9 为向用户提供服务。时间银行将在合理范围内使用用户个人信息、注册信息、非用户个人信息以及第三方平台记录信息。用户一旦注册、登录、使用时间银行 服务，将被视为时间银行 已包括但不限于收集、统计、分析、商业用途等方式使用用户信息。时间银行对用户信息的使用无需其他意思表示，无需向用户支付任何费用。</p>
        <p>2.10 用户同意接受时间银行 通过短信、电话、电子邮件、即时通信的客户端（网页）或者其他合法方式，向时间银行 网站、移动客户端用户发送包括订单信息、专题推荐、促销活动等信息。</p>
        <p>第三条 服务</p>
        <p>本协议所称“服务”，特指通过时间银行网站及移动客户端提交的管理咨询服务行为，网站及客户端用户与讲师之间的管理咨询服务交易必须通过时间银行及旗下网站或者移动客户端完成，不得私下交易。如有违背，时间银行有权拒绝支付交易金额、处以罚款以及暂停或者永久性关闭帐户的权利。</p>
        <p>3.1 时间银行网站及客户端上的讲师服务方向、价格、数量均由讲师发布并随时可能发生变动，时间银行不作其他形式的特别通知。因一些不可预知的客观原因，时间银行网站显示的信息可能会有一定的滞后性或差错，对此情形希望您知悉并理解。</p>
        <p>3.2 企业下单时须仔细确认您购买的服务的价格及支付方式、联系人、联系方式、联系地址、约见时间地点等内容；订单一旦生成，即被视为企业向时间银行讲师用户发出合同邀约。</p>
        <p>3.3 讲师收到企业的合同邀约后，有权利对企业的约见申请进行审核，行使同意约见或者拒绝约见的权利；讲师确定接受订单并向企业提供实际的服务时，方视为企业与讲师用户之间建立了合同关系。</p>
        <p>3.4 除台风、地震、海啸、洪水、战争、恐怖袭击等国际通用约定不可抗力情况外，企业迟到半小时及以上或没有赴约，视为服务交易依旧成立；同样的，除上述不可抗力因素外，讲师迟到半小时及以上或没有赴约，视为服务交易不成立，企业有权要求取消订单，并可向平台发起申诉。</p>
        <p>3.5 讲师应确保在自身专业领域具备相关专业知识或经验，并向时间银行提交证明自身在某一方面具备专业能力的相关材料。交谈只限于根据企业的主观描述，讲师需尽其所能利用自身专业领域所积累的知识和经验，对自己提供给企业的服务质量负责，不得提供超出个人专业领域以及能力的服务。讲师用户在此确认，如有违背，由此引发的纠纷完全由讲师自行承担。时间银行在此声明，不对约见结果是否符合用户预期做出任何保证，不承担任何责任。</p>
        <p>3.6 讲师所提供的建议及经验均系个人建议及经验，企业需知晓并同意此类建议及个人经验仅供参考。若将讲师的建议及经验作为决策依据，由此可能引发的任何负面影响甚至损失由企业自行负责，时间银行平台不予以负责。同时企业在此声明同意不会向时间银行及讲师提出任何性质的索赔。</p>
        <p>3.7 线下服务时，企业和讲师需自行确定会见场所，为保证企业及讲师用户的人身安全，时间银行在此明确，会见必须在公共场合；时间银行不承担任何安全方面的责任。
        <p>3.8 企业和讲师在交谈过程中及约见完成后的所有后续沟通中应该要文明用语、互相尊重、平等交流。如需在交谈过程中进行录音、录像等记录活动，应取得对方的许可或同意。企业（讲师）不得在语言和行为上恐吓、威胁或骚扰讲师（企业），或者侵犯、试图侵犯他人的隐私以及人身安全。如发生以上行为，讲师用户有权立即中断交谈，企业无权要求退款；企业有权立即中断交谈，并要求退款；时间银行有权终止相关方的所有权利，如有相关的争议发生，时间银行将在尊重事实及法律的基础上以合理形式支持被侵权方进行维权。
        <p>第四条 费用、支付及税款缴纳</p>
        <p>4.1 用户如需使用时间银行讲师用户提供的收费服务，必须不可撤销地授权委托时间银行向讲师用户提供服务咨询费用。</p>
        <p>4.2 用户须遵守时间银行的定价条款规则，讲师拥有设定、调整服务价格的权利，有权按事先公布的收费方式向企业收取交谈费用，并不可撤销地授权委托时间银行代为向企业收取服务费用。</p>
        <p>4.3 时间银行有权调整讲师提供交谈服务所涉及的计费方式和收费方式，具体以时间银行公布的相关收费规则或时间银行与讲师之间的相关协议为准。</p>
        <p>4.4 企业必须遵守讲师的定价规则，并按照定价规则向平台讲师支付费用。</p>
        <p>4.5 为保证及有效监督服务质量，交易费用由时间银行先行代为收取，在服务交易完成后十（10）个工作日内由时间银行向讲师的平台账户余额里发放费用。</p>
        <p>4.6 根据我国法律及税收政策，时间银行平台的所有用户有义务就本人在平台上的劳务报酬所得（包括但不限于时间银行平台约见）按时、足额的缴纳相关税费。时间银行平台有权随时根据税务部门的最新政策或指导意见，即时调整用户税款缴纳问题的执行方式及相关规定。</p>
        <p>4.7 用户在此确认如下，时间银行保有如下所示单项权利：若相关税务部门要求时间银行提供用户账户信息以核实用户自行申报的在平台收入具体数额，平台有权不经用户同意而进行披露，并根据国家法律配合相关税务部门的其他合法要求。</p>
        <p>4.8 对于时间银行的约见反馈及评价体系，任何用户不可采取任何损坏、破坏或操纵的行为。对于约见反馈及评价体系有异议或疑问的用户，在交易完成后十（10）个工作日内具有申诉的权利。</p>
        <p>第五条 时间银行与用户双方的权利和义务</p>
        <p>时间银行提供平台，讲师可在时间银行网站或者移动客户端通过线下服务的形式向企业提供有偿的咨询服务（以下简称“服务”）；企业通过时间银行网站或者移动客户端有偿获得讲师提供的咨询服务（以下简称“服务”）。</p>
        <p>5.1 作为面向企业负责人提供管理咨询与精英型人才撮合交易的服务平台，时间银行不直接参与用户之间的交易。基于交易纠纷、技术原因等因素，时间银行保有复制、审查交易过程及内容的权利。</p>
        <p>5.2 时间银行网站及移动客户端所展示的服务和价格等信息仅仅是讲师的邀约，不是该服务的提供方或担保方。</p>
        <p>5.3 时间银行有义务对相关数据、所有的申请行为以及与咨询有关的其它事项进行审查，有权根据不同情况选择保留或删除相关信息或继续、停止对该用户提供服务，并追究相关法律责任。</p>
        <p>5.4 时间银行不对以下结果进行保证：</p>
        <p>1）不保证各平台上任何用户所提供资料的真实、准确、安全、合法等问题，由此引发的纠纷，用户自行承担风险；</p>
        <p>2）时间银行所承载的内容均为传播资讯目的，不对其真实性、科学性、严肃性做任何形式保证；</p>
        <p>3）时间银行不保证讲师所提供服务的意愿和能力，以及是否适用于企业的实际需求；</p>
        <p>4）时间银行不保证企业对于讲师服务的满意度，以及企业对于讲师的反馈及评价；</p>
        <p>5) 因企业对讲师服务质量不满所引起的任何纠纷，时间银行对此不负有任何赔偿责任。</p>
        <p>5.5 为便于企业与讲师的使用，商帝国有义务维护平台服务的正常运行，提升及改进技术。</p>
        <p>5.6 如本条第4款所确认的，时间银行不对讲师服务质量做任何保证，也不对因讲师服务质量所引起的任何纠纷负有经济赔偿义务。但企业对讲师咨询内容若不满意，则有权利向时间银行提出投诉或进行申诉，时间银行有义务依据实际情况开展协调沟通。如因在时间银行上发生服务纠纷，时间银行有义务向双方了解相关信息，进行沟通、调解；用户通过司法部门或行政部门依照法定程序要求时间银行提供相关数据，时间银行将积极配合并提供有关资料。</p>
        <p>5.7 为保证服务质量，时间银行提供客服电话服务功能。为保证服务质量，保障交易过程及内容的可追溯性，时间银行保有客服与用户服务过程中全程录音的权利，时间银行承诺不主动将录音内容泄露给第三方，但基于交易纠纷、技术原因等因素，时间银行保有复制、审查服务过程中录音内容的权利。</p>
        <p>5.8 时间银行平台严正声明，针对用户（讲师/企业）于时间银行平台上所发生的恶意刷单、恶意退款、虚假约见、订单异常、恶意获取好评及人气等违规/非法行为的，保有进行问询了解、开展调查、作出处罚等权利。以上违规/非法行为对时间银行平台造成实际损失的（包括但不限于：经济损失、商誉受损等情况），时间银行平台有权利停止其结算、扣除违规所得，同时责任方用户还应依照损失情况进行赔偿，平台同时保有追究相关责任方用户法律责任的权利。</p>
        <p>5.9 针对本协议第5.8条中所提及的违规/非法行为，用户（讲师/企业）在接到平台问询或调查要求时，有权利进行自我申辩，并提供相关的证据材料证明己方申辩观点，平台将对用户的自我申辩予以足够重视并进行充分核实。 用户可通过口头申辩、书面回函解释、提供第三方证言、提供书面证据材料、提供语音/视频材料等形式进行自我申辩，时间银行平台将结合调查中所掌握的客观事实及用户所提供的自我申辩材料的整体情况，做出最终的判断及处理方案。 如用户在规定期限内不进行自我申辩，或无法提供任何直接/间接证明材料的，视为用户放弃此项权利，由此所可能产生的任何不利影响或负面处理结果应由用户自行承担，时间银行平台在此特予以郑重提醒。</p>
        <p>第六条 用户言行</p>
        <p>6.1 用户同意在使用时间银行服务过程中，遵守国家法律、法规，严格注意自身所发布的言论及内容。所有用户不得发布如下言论及内容，一经违反，时间银行将予以严肃处理：</p>
        <p>1）发布反对我国宪法所确定的基本原则或我国法律法规所规定的言论及内容；</p>
        <p>2）发布危害国家安全、泄露国家秘密、颠覆国家政权以及破坏国家统一的言论及内容；</p>
        <p>3）发布损害国家荣誉、国家利益及公共利益的言论及内容；</p>
        <p>4）发布煽动民族仇恨、民族歧视，破坏民族团结的言论；</p>
        <p>5）发布破坏国家宗教政策，宣扬邪教和封建迷信的言论及内容；</p>
        <p>6）散布不实谣言，扰乱社会秩序、破坏社会稳定的言论及内容；</p>
        <p>7）发布涉及国家历任领导人及点评时政的相关言论及内容；</p>
        <p>8）发布侮辱或诽谤他人，侵害他人合法利益的言论及内容；</p>
        <p>9）发布对未成年人有不良影响的言论及内容；</p>
        <p>10）散布淫秽、色情、赌博、暴力、凶杀、恐怖、非法宗教或者教唆犯罪的行为；</p>
        <p>11) 利用时间银行平台从事洗钱、窃取商业秘密、窃取其他用户个人信息等违法犯罪活动；</p>
        <p>12) 侵入本站及国家计算机信息系统，传播病毒、特洛依木马、定时炸弹等可能对时间银行网站、移动客户端系统造成伤害或影响其正常运转的恶意病毒或程序；</p>
        <p>13) 不得从事非经时间银行同意的所有牟利性经营活动；</p>
        <p>14) 不得侵犯第三方权利，特别是他人著作权、商标权等知识产权或者合法权利。</p>
        <p>6.2 除本条第1款中所列情况外，若用户有其他发布违法信息、不良信息、严重违背社会公德、以及其他违反法律禁止性规定的行为，还有例如提供的个人资料不真实、或与注册时信息不一致又未能提供合理证明、依据监管部门的要求、出于安全的原因或其他必要的情形等，时间银行保有删除各类不符合法律政策或者不真实信息内容而无须通知用户的权利。若用户未遵守以上约定，时间银行有权立即终止对用户提供服务，采取降权、暂停或者关闭用户账户等措施。时间银行再次严正声明，所有用户须对自己的言论和行为负法律责任。</p>
        <p>6.3 有关于本条中第1款及第2款所涉及的不当言论及内容的判定，由时间银行的专门审核人员所负责，商帝国对此拥有最终解释权。</p>
        <p>第七条 知识产权协议</p>
        <p>7.1 对于用户通过时间银行所发布的任何公开信息，用户在此确认并同意时间银行在全球范围内对上述公开信息享有免费的、永久性的、不可撤销的、非独家的和完全再许可的权利和许可，并以使用、复制、修改、改编、汇编、出版、翻译、据以创作衍生作品、传播、表演和公开展示此等内容（整体或部分），和/或将此等内容编入当前已知的或以后开发的其他任何形式的作品、媒体或技术中。</p>
        <p>7.2 除法律规定外，未经时间银行书面形式的明确许可，任何单位或个人不得以任何方式全部或部分复制、转载、引用、链接、抓取或以其他方式使用时间银行网站、移动客户端移动客户端的信息内容（包括但不限于：源程序和文档、用户界面设计、文案等）。商帝国在此严正声明，如有违反本条协议者，一经调查及核实，商帝国将决不姑息，坚决追究其法律责任，并要求其赔偿因其行为所造成的任何经济损失。</p>
        <p>7.3 用户在时间银行所发布的内容及其他智力成果，必须保证其已经拥有必要的知识产权权利或得到明确授权以进行该内容或智力成果的提供、发布、提交等行为。用户在此同意并承诺，在时间银行平台上的内容及其他智力成果不构成对他人知识产权或其他权利的侵犯。因用户违反上述承诺，所造成或引起的任何形式的法律纠纷，由用户个人承担法律责任，时间银行不承担任何相应法律及经济责任。</p>
        <p>7.4 非经时间银行同意，用户承诺不得将已发表于时间银行网站或移动客户端的话题等信息内容和/或智力成果，发布于或授权于与时间银行存在直接竞争关系的同类网站或移动客户端使用。一经发现，时间银行有权暂停或永久性关闭用户的时间银行帐号，同时要求用户撤销其在同类竞争网站或移动客户端上使用的已发表于时间银行网站或移动客户端的信息内容和/或智力成果。</p>
        <p>7.5 本用户协议已经构成《中华人民共和国著作权法》及相关法律规定的著作权财产性权利（包括但不限于：复制权、发行权、出租权、展览权、表演权、广播权、信息网络传播权、改编权、摄制权、翻译权、汇编权等）的转让书面协议，其效力及于用户在时间银行网站、移动客户端移动客户端上发布的任何受著作权法保护的作品内容。</p>
        <p>第八条 隐私声明</p>
        <p> 时间银行非常重视对您（所有用户包括企业及讲师）个人隐私的保护。您所提供的个人信息等资料以及时间银行所保留的用户个人资料，将受到中国有关隐私的法律以及时间银行隐私政策的特别保护。
        <p>特定情况下时间银行需要某些信息才能为您提供所请求的特定服务，本隐私声明针对这些情况下的数据收集和使用情况。</p>
        <p>作为时间银行用户，如果同意接受时间银行用户协议及隐私声明，表明您授权时间银行 对任何您所提供的、或者时间银行所收集到的信息有权进行处理、传播、使用。</p>
        <p>本隐私声明条款适用于时间银行网站、移动客户端移动客户端的所有服务，随着服务的变化，时间银行有权对隐私条款不时进行修改更新，且不再另行通知。更新后的隐私声明一旦在网页或者移动客户端上公布即有效代替旧版本的隐私声明，您在访问和使用时间银行的网站或者移动客户端时，即表示您已同意遵守并接受最新的隐私政策。商帝国在此特别建议您经常关注隐私条款的变更。</p>
        <p>8.1 时间银行隐私信息范围</p>
        <p>1）个人信息</p>
        <p>在使用时间银行网站、移动客户端移动客户端时，通常情况下，您能在匿名的状态下访问时间银行并获取信息。您在时间银行网站或者移动客户端注册时所提交的个人信息，包括姓名、联系方式、通讯地址、第三方帐户信息等。</p>
        <p>2）帐户信息</p>
        <p>企业为获得讲师咨询服务时，必须根据平台的要求提供基本必要的信息；讲师在服务交易完成后接收费用，亦必须提供基本必要的个人财务信息，如姓名、银行帐户、第三方支付帐户信息等。</p>
        <p>3）交流信息</p>
        <p>时间银行通过网站、移动客户端，在用户与时间银行客服之间，在企业与讲师之间，通过评价反馈体系、日程安排等方式产生信息交流。</p>
        <p>8.2 信息隐私的保护</p>
        <p>时间银行严格保护您个人信息的安全。我们使用各种安全技术和程序来保护您的个人信息不被未经授权的访问、使用或泄露。</p>
        <p>当用户对商帝国的网站或者移动客户端的服务表示兴趣时，或者当向用户提供服务出现问题或者困难时，我们将使用这些信息来联系用户。</p>
        <p>未经用户同意，时间银行不会对用户之间的交流信息，包括企业评价、交流文本和图片内容进行编辑、筛选、篡改。</p>
        <p>如果有明确证据表明您所提供的信息存在不符合法律政策或者不真实情况，我们有权无须通知您对信息进行删除、更改等处理。</p>
        <p>第九条 免责说明</p>
        <p>9.1 就下列相关事宜的发生，时间银行在此声明不承担任何法律责任：</p>
        <p>1）用户应遵守国家的有关法律、法规和行政规章制度。如有用户违反国家法律法规或本用户协议，时间银行有权停止向用户提供任务而不需要承担任何责任；如用户的不法使用行为导致时间银行遭受任何损害或者遭受任何来自第三方的纠纷、诉讼、索赔要求等，用户须向时间银行赔偿相应的损失，用户需对其违反用户协议所产生的一切后果承担全部法律责任；</p>
        <p>2）由于您将用户密码告知他人或与他人共享注册帐户，由此导致的任何个人信息的泄露，或其他非因时间银行方面原因导致的个人信息的泄露；</p>
        <p>3）根据法律规定或政府相关政策要求提供您的个人信息；</p>
        <p>4）任何通过黑客攻击、电脑病毒侵入等非法截取、访问等方式从我们网站上获取的信息；以及</p>
        <p>5）因台风、地震、海啸、洪水、停电、战争、恐怖袭击等国际通用不可抗力因素导致的任何后果。</p>
        <p>9.2 本协议下的服务行为涉及到互联网及移动通讯等服务，可能受各个环节不稳定因素的影响，比如不可抗力、计算机病毒或者黑客攻击等造成的服务中断或不能满足用户要求的风险，用户须理解和认可，并承担以上风险。基于上述已经提及的可能发生的各环节不稳定因素影响，时间银行在此声明对服务的及时性、安全性、准确性不作担保，对因此导致用户不能接收信息，或者传递错误等问题不承担任何责任，此点用户须理解并认可。</p>
        <p>9.3 如因时间银行的自有系统发生故障而影响到本服务的正常运行，时间银行承诺第一时间内与相关单位配合，及时处理并进行修复。但用户因此而产生的经济损失，时间银行不承担责任。此外，时间银行保留不经事先通知为维修保养、升级或其他目的暂停本服务任何部分的权利。</p>
        <p>9.4 在使用本协议下服务的过程中，可能会遇到网络信息或其他用户的行为所带来的风险，时间银行不对任何信息的真实性、适用性、合法性承担责任，也不对因侵权行为给您造成的损害负责。这些风险包括但不限于：</p>
        <p>1）来自他人匿名或冒名的含有威胁、诽谤、令人反感或非法内容的信息；</p>
        <p>2）因使用本协议项下的服务，遭受他人误导、欺骗或其他导致或可能导致的任何心理、生理上的伤害以及经济上的损失；以及</p>
        <p>3）其他因网络信息或用户行为引起的风险。</p>
        <p>第十条 适用法律框架以及争议解决途径</p>
        <p>本协议的订立、执行、解释及争议的解决均应适用中华人民共和国法律及法规。如发生本协议部分内容与适用法律、法规相抵触时，此部分协议抵触内容应以适用法律为准。同时此部分协议抵触内容不影响协议其他部分的效力，即协议其他部分继续有效。如协议缔约双方就本协议内容或其执行发生任何争议，双方应共同勉力友好协商解决；协商不成时，任何一方均可向有管辖权的中华人民共和国法院提起诉讼。</p>
        <p>第十一条 其他</p>
        <p>11.1 为了更多用户的利益及实现共享知识经济的本质，时间银行将不定期的举行各类用户回馈活动（包括但不限于：如优惠课程包、线下免费讲课等），平台所有用户在此确认并同意，许可时间银行开展此类活动，平台将不再予以特别通知。</p>
        <p>11.2 商帝国在此明确，时间银行平台目前仅支持中文语种，对于其他语种的相关功能及需求暂不支持。时间银行鼓励并支持用户使用中文参与平台各类活动、使用平台各类功能，实现共享知识经济的良好初衷。</p>
        <p>11.3 如您在中国大陆以外的国家或地区访问或使用时间银行网站、移动客户端移动客户端，您将有责任严格遵守所在国家或地区内有关在线行为和可接受内容的法律规制。</p>
        <p>11.4 本协议下的服务之所有权、运作权和一切解释权归商帝国所有。商帝国有权在必要时修改并更新用户协议，并通过网站或者移动客户端发布修改、变更消息，且不再另行通知。如果在修改更新生效后用户继续使用服务，则视为您接受用户协议的变动并遵守最新用户协议。</p>
        <p>如果您对用户协议有任何疑问，请联系dong@shangdiguo.com</p>
      </div>
    </div>
  </div>
</template>

<script>
import Navbar from '../../../views/navbar/navbar'
// import TipsTools from '../../../common/TipsTools'
// let lib = new TipsTools()
export default {
  name: 'AgreementPushYy',
  components: {
    Navbar
  },
  data () {
    return {
      titleMsg: '注册协议'
    }
  },
  computed: {},
  methods: {
    returnRegister () {
      this.$router.push('/register')
    }
  },
  mounted () {}
}
</script>

<style scoped>
  .wapper{background:rgba(255,255,255,1);border-radius:0.05rem;margin: 0.66rem 0.1rem;}
  .agreement{font-size: 0.14rem;font-family:PingFangSC-Regular;line-height: 0.2rem;padding: 0.2rem 0.1rem;}
  .navbar {
    position: fixed;
    top: 0;
    left: 0;
    display: flex;
    flex-direction: row;
    justify-content: space-between;
    align-items: center;
    width: 100%;
    height: 0.66rem;
    z-index: 10;
    text-align: center;
    background: #f5f5f5;
  }
  .navbar .item {
    min-width: 0.2rem;
  }
  .navbar .left-btn {
    text-align: left;
    margin-left: 0.1rem;
    padding: 0.1rem 0;
    user-select: none;
    color: black;
    font-size: 0.18rem;
  }
  .navbar .left-btn:active {
    color: #dcbc6c;
  }
  .navbar .title {
    padding: 0.2rem 0;
    user-select: none;
    color: black;
    font-size: 0.2rem;
    font-family:PingFangSC-Semibold;
    font-weight:600;
    flex: 1;
    text-align: center;
  }
  .navbar .right-btn {
    width: 0.6rem;
    margin-right: 0.1rem;
    padding: 0.12rem 0 0.08rem 0;
    user-select: none;
    color: black;
    font-size: 0.15rem;
    text-align: right;
  }
  .navbar .right-btn:active {
    color: #dcbc6c;
  }
</style>
