<template>
  <div>
    <div class="navbar">
      <div class="left-btn">
        <i class="iconfont iconxiazai6" @click="returnRegister"></i>
      </div>
      <div class="item title">
        时间银行用户隐私协议
      </div>
    </div>
    <div class="wapper">
      <div class="agreement">
        <p>欢迎您使用时间银行（以下简称“本软件”）！为保护您的通信秘密，提供便捷的服务，请您在使用本软件前务必审慎阅读、充分理解各条款内容。本隐私权政策包含了我们收集、存储、使用、共享和保护您和您的最终用户的个人信息的条款，我们希望通过本隐私权政策向您清晰地介绍我们对您和您的最终用户的个人信息的处理方式，因此我们建议您完整地阅读本隐私权政策，以帮助您了解维护自己隐私权的方式。您如果继续本软件，即视为您已接受本政策的任何条款。</p>
        <p>一、我们收集的信息（您须授权我们收集和使用您个人信息的情形）</p>
        <p>我们仅会出于以下目的，收集和使用您的个人信息：</p>
        <p>1、当您使用本软件时，我们会要求您提供您的个人信息，包括：本隐私政策中涉及的个人信息包括：基本信息（包括个人姓名、生日、性别、住址、个人电话号码、电子邮箱、受教育程度、所属行业）；个人身份信息（包括身份证等）；网络身份标识信息（包括系统账号、IP地址、邮箱地址）；个人财产信息（交易和交易记录、以及余额、优惠券等虚拟财产信息）；个人上网记录（包括网站浏览记录、软件使用记录、点击记录）；个人常用设备信息（包括硬件型号、设备MAC地址、操作系统类型、软件列表唯一设备识别码（如IMEI/android ID/IDFA/OPENUDID/GUID、SIM卡IMSI信息等在内的描述个人常用设备基本情况的信息）；</p>
        <p>2、当您使用本软件时，我们获取的信息，包括：</p>
        <p>-本软件相关信息；</p>
        <p>-IP地址；</p>
        <p>-主动上传的个人头像、发表的评论；</p>
        <p>-使用服务时的操作记录；</p>
        <p>-您的产品信息，例如移动应用的名称、内容、类别和某些特性等。</p>
        <p>3、您通过其他方式主动向我们提供的信息，包括但不限于其他用户、问卷、邮件、电话。</p>
        <p>二、我们收集信息的途径</p>
        <p>1、您向我们提供信息的情形</p>
        <p>-用户注册，您在注册帐户时填写的个人信息，例如您本人的手机号码，我们将通过发送短信验证码的方式来验证您的身份是否有效。您的账户名为您的默认昵称，您可以修改补充您的昵称以及您的实名验证相关信息，这些信息均属于您的“账户信息”。您补充的账户信息将有助于我们为您提供个性化的内容推荐和更优的体验，但如果您不提供这些补充信息，不会影响您的基本功能；</p>
        <p>-信息展示和搜索，为了让您快速地找到您所需要的商品，我们可能会收集您使用我们的产品或服务的设备信息（包括设备名称、设备型号、设备识别码、操作系统和应用程序版本、语言设置、分辨率、服务提供商网络ID（PLMN））、浏览器类型来为您提供商品信息展示的最优方式。</p>
        <p>-日志信息：当您使用我们的网站或客户端提供的产品或服务时，我们会自动收集您对我们服务的详细使用情况，作为有关网络日志保存。例如您的搜索查询内容、IP地址、浏览器的类型、电信运营商、使用的语言、访问日期和时间及您访问的网页记录等。</p>
        <p>-客户服务：当您通过我们网站上公布的电子邮箱、地址、电话与我们联系时，您可能提供个人信息，我们将使用这些信息回应您的问题和服务要求。</p>
        <p>2、我们从第三方获得您个人信息的情形</p>
        <p>我们可能从第三方获取您授权共享的账户信息（头像、昵称），并在您同意本隐私政策后将您的第三方账户与您的账户绑定，使您可以通过第三方账户直接登录并使用我们的产品与/或服务。我们会将依据与第三方的约定、对个人信息来源的合法性进行确认后，在符合相关法律和法规规定的前提下，使用您的这些个人信息。</p>
        <p>3、您选择授权我们收集和使用您的个人信息的情形：</p>
        <p>-基于摄像头（相机）的附加功能：您可以使用这个附加功能完成头像的拍摄功能。</p>
        <p>-基于图片上传的附加功能：您可以上传您的照片来实现个性头像功能及评价功能。</p>
        <p>-基于语音技术的附加功能：您可以直接使用麦克风来进行互动。在这些功能中我们会收集您的录音内容以识别您的需求。</p>
        <p>上述附加功能可能需要您在您的设备中向我们开启您的相机（摄像头）、相册（图片库）、麦克风的访问权限，以实现这些功能所涉及的信息的收集和使用。请您注意，您开启这些权限即代表您授权我们可以收集和使用这些个人信息来实现上述的功能，您关闭权限即代表您取消了这些授权，则我们将不再继续收集和使用您的这些个人信息，也无法为您提供上述与这些授权所对应的功能。您关闭权限的决定不会影响此前基于您的授权所进行的个人信息的处理。</p>
        <p>4、您在使用时间银行的产品及服务期间，我们将持续为您保存您的个人信息。如您想要删除个人信息，可以通过【dong@shangdiguo.com】方式与我们联系。</p>
        <p>5、您的个人信息将存放在中华人民共和国国内的服务器，存放期限为法律规定范围内的最短期限。</p>
        <p>6、商帝国的名称为：青岛商帝国管理咨询有限公司。注册地址为：青岛市市南区燕儿岛路18号鹏程花园C座2112户。</p>
        <p>三、我们如何使用 Cookie</p>
        <p>1、为实现您联机体验的个性化需求，使您获得更轻松的访问体验。我们会在您的计算机或移动设备上发送一个或多个名为Cookies的小数据文件，指定给您的Cookies 是唯一的，它只能被将Cookies发布给您的域中的Web服务器读取。我们向您发送Cookies是为了简化您重复登录的步骤、存储您的购物偏好或您购物车中的商品等数据进而为您提供购物的偏好设置、帮助您优化对广告的选择与互动、帮助判断您的登录状态以及账户或数据安全。</p>
        <p>2、我们不会将 Cookies 用于本隐私政策所述目的之外的任何用途。您可根据自己的偏好管理或删除Cookies。您可以清除计算机上保存的所有 Cookies，大部分网络浏览器会自动接受Cookies，但您通常可根据自己的需要来修改浏览器的设置以拒绝 Cookies；另外，您也可以清除软件内保存的所有Cookies。但如果您这么做，您可能需要在每一次访问京东网站时亲自更改用户设置，而且您之前所记录的相应信息也均会被删除，并且可能会对您所使用服务的安全性有一定影响。</p>
        <p>四、如何使用收集到的信息</p>
        <p>我们使用这些信息是用于：</p>
        <p>1、了解和管理账户；</p>
        <p>2、响应您的个性化需求，为您提供更舒适的用户体验；</p>
        <p>3、了解您的需求以确定完善的产品和服务，改善服务内容和界面设计；</p>
        <p>4、基于市场营销和促销的目的联系您，并为您提供更多有关我们产品的信息；</p>
        <p>5、进行研究和分析，提升我们的服务质量；</p>
        <p>6、管理软件，进行软件认证和升级。</p>
        <p>-了解和管理账户信息。</p>
        <p>-为您提供个性化服务。</p>
        <p>-帮助我们设计新服务，提升现有服务体验。</p>
        <p>-在我们提供服务时，用于身份验证、客户服务、安全方法、存档和备份用途时，确保我们想您提供的产品和服务的安全性。</p>
        <p>-向您发送您可能感兴趣的产品和服务信息；邀请您参与活动和市场调查。</p>
        <p>-开站内部审计、数据分析和研究，以更好的改善我们的产品、服务及与用户之间的沟通。</p>
        <p>-管理软件，进行软件认证和升级。</p>
        <p>五、数据安全管理</p>
        <p>1、尽管我们已经尽到合理努力，但您的信息仍有可能被盗、非法拥有或者滥用而给您带来人身、财产和声誉等方面损失的危险。您已了解上述风险并自愿承担。</p>
        <p>2、我们将采用行业内通行的、合理的标准来保护我们所储存的信息的安全性和保密性。（我们会采用符合业界标准的安全防护措施，包括建立合理的制度规范、安全技术来防止您的个人信息遭到未经授权的访问使用、修改,避免数据的损坏或丢失。）包括但不限于：防火墙和数据备份措施；数据中心的访问权限限制；雇员保密协议和安全管理制度；对移动终端的识别性信息，如IMEI号码和MAC地址进行哈希处理等等。 时间银行的网络服务采取了传输层安全协议等加密技术，通过https等方式提供浏览服务，确保用户数据在传输过程中的安全。 时间银行采取加密技术对用户个人信息进行加密保存，并通过隔离技术进行隔离。在个人信息使用时，例如个人信息展示、个人信息关联计算，我们会采用包括内容替换在内多种数据脱敏技术增强个人信息在使用中安全性。 时间银行采用严格的数据访问权限控制和多重身份认证技术保护个人信息，避免数据被违规使用。 时间银行采用代码安全自动检查、数据访问日志分析技术进行个人信息安全审计等等。</p>
        <p>3、存储信息的地点和期限：时间银行有权根据实际情况自行决定单个用户在本软件及服务中数据的最长储存期限，并在服务器上为其分配数据最大存储空间等。你可根据自己的需要自行备份本软件及服务中的相关数据。如果你停止使用本软件及服务或服务被终止或取消，时间银行可以从服务器上永久地删除你的数据。服务停止、终止或取消后，时间银行没有义务向你返还任何数据。</p>
        <p>4、若发生信息泄露等安全事件，我们会启动紧急方案，并以推送通知、公告等形式告知您。</p>
        <p>六、如何对第三方分享信息</p>
        <p>除非本政策已说明的情况外，您的数据不会被以可识别的形式向第三方披露和共享。但以下情况除外：</p>
        <p>-因履行法定义务和国家司法、行政机关根据法律、行政法规的规定要求而需要披露的；</p>
        <p>-我们有可能聘请第三方供应商、顾问或其他服务商为我们提供必要的维护、支持和服务，当我们聘请第三方执行某些职能时，我们可能授权第三方使用某些执行特定职能相关的数据；</p>
        <p>-根据我们与第三方签订的合同，需要提供必要的信息，但我们将在合同中约定第三方应对所获信息采取保密措施。</p>
        <p>-在紧急情况下，经合理判断是为了保护我们、我们的代理人、客户、终端用户或其他人的合法权益和安全的。</p>
        <p>-我们正在或拟进行企业并购、重组、出售全部或部分股份和业务或资产等重大变化，包括但不限于尽职调查过程、资产转让。</p>
        <p>七、免责条款：</p>
        <p>除本政策已列明的免责情况外，下列情况也无须承担任何责任：</p>
        <p>-由于您保管不善，导致的个人数据泄露、遗失、被篡改等；</p>
        <p>-任何由于黑客攻击、计算机病毒侵入等不可抗力造成的个人数据的泄露、遗失、被篡改等；</p>
        <p>-其他非本软件导致的个人数据的泄露、遗失、被篡改等由此产生的任何争议和后果。</p>
        <p>-所公开的信息属于以下任意一种情形的：出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到您本人同意的；所收集的个人信息是您自行向社会公众公开的；从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道；根据您的要求签订合同所必需的；用于维护所提供的产品或服务的安全稳定运行所必需的，例如发现、处置产品或服务的故障;为合法的新闻报道所必需的公开；学术研究机构基于公共利益开展统计或学术研究所必要，且对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的；法律法规规定的其他情形。</p>
        <p>八、我们可能向您发送的信息</p>
        <p>为完善服务，我们可能向您发送以下信息：</p>
        <p>-课程更新通知；</p>
        <p>-课程资讯；</p>
        <p>-版本更新通知；</p>
        <p>-用户使用满意度问卷调查；</p>
        <p>-关联产品推广、上新通知；</p>
        <p>-与本软件及软件开发商有关的重大信息通知。</p>
        <p>九、政策调整</p>
        <p>我们有权根据服务内容、适用法律和政策的调整以及其他因素随时调整本政策。本政策的任何更新将以标注更新时间的方式公布在本网页上。</p>
        <p>十、未成年人保护</p>
        <p>若您是18周岁以下的未成年人，在使用本软件前，应取得您的家长或法定监护人的同意。</p>
        <p>十一、适用法律与争议解决</p>
        <p>本政策适用中华人民共和国法律。您和本软件及软件开发商之间发生的任何形式的争议均应友好协商解决。协商不成的，双方一方均有权将向时间银行所在的北京市朝阳区有管辖权的法院提起诉讼。</p>
        <p>十二、联系我们</p>
        <p>如您对本政策或其他相关事宜有疑问，请通过【服务邮箱：dong@shangdiguo.com】与我们联系。我们将尽快审核所涉问题，并在验证您的用户身份后的三十天内予以回复。</p>
      </div>
    </div>
  </div>
</template>

<script>
import { SHOW_GLOBAL_REGISTER, SHOW_YISI_AGREEMENT } from '../../../store/MutationTypes'
import Navbar from '../../../views/navbar/navbar'
// import TipsTools from '../../../common/TipsTools'
// let lib = new TipsTools()
export default {
  name: 'YiSiAgreement',
  components: {
    Navbar
  },
  data () {
    return {
      titleMsg: '注册协议'
    }
  },
  computed: {},
  methods: {
    returnRegister () {
      this.$store.dispatch(SHOW_GLOBAL_REGISTER, true)
      this.$store.dispatch(SHOW_YISI_AGREEMENT, false)
    }
  },
  mounted () {}
}
</script>

<style scoped>
  .wapper{background:rgba(255,255,255,1);border-radius:0.05rem;margin: 0.66rem 0.1rem;}
  .agreement{font-size: 0.14rem;font-family:PingFangSC-Regular;line-height: 0.2rem;padding: 0.2rem 0.1rem;}
  .navbar {
    position: fixed;
    top: 0;
    left: 0;
    display: flex;
    flex-direction: row;
    justify-content: space-between;
    align-items: center;
    width: 100%;
    height: 0.66rem;
    z-index: 10;
    text-align: center;
    background: #f5f5f5;
  }
  .navbar .item {
    min-width: 0.2rem;
  }
  .navbar .left-btn {
    text-align: left;
    margin-left: 0.1rem;
    padding: 0.1rem 0;
    user-select: none;
    color: black;
    font-size: 0.18rem;
  }
  .navbar .left-btn:active {
    color: #dcbc6c;
  }
  .navbar .title {
    padding: 0.2rem 0;
    user-select: none;
    color: black;
    font-size: 0.2rem;
    font-family:PingFangSC-Semibold;
    font-weight:600;
    flex: 1;
    text-align: center;
  }
  .navbar .right-btn {
    width: 0.6rem;
    margin-right: 0.1rem;
    padding: 0.12rem 0 0.08rem 0;
    user-select: none;
    color: black;
    font-size: 0.15rem;
    text-align: right;
  }
  .navbar .right-btn:active {
    color: #dcbc6c;
  }
</style>
